# Add Repository
tap 'aws/tap'
tap 'universal-ctags/universal-ctags'

# Packages
cask 'temurin'

brew 'ansible'
brew 'ant'
brew 'antiword'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'awsebcli'
brew 'aws-sam-cli'
brew 'biome'
brew 'breezy'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'deno'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'gawk'
brew 'gettext'
brew 'gh'
brew 'git'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gpg'
brew 'graphviz'
brew 'hg'
brew 'htop-osx'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq'
brew 'kayac/tap/ecspresso'
brew 'lua'
brew 'mise'
brew 'mpv'
brew 'msgpack'
brew 'nkf'
brew 'opencv'
brew 'openssl'
brew 'optipng'
brew 'pcre'
brew 'peco'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pkg-config'
brew 'pngquant'
brew 'potrace'
brew 'protobuf'
brew 'pstree'
brew 'python'
brew 'rbenv'
brew 're2c'
brew 'readline'
brew 'ripgrep'
brew 'rustup-init'
brew 'sipcalc'
brew 'sqlite'
brew 'terminal-notifier'
brew 'texi2html'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'universal-ctags', args: ['HEAD']
brew 'uv'
brew 'wget'
brew 'yarn', args: ['ignore-dependencies']
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'alfred'
cask 'charles'
cask 'claude'
cask 'claude-code@latest'
cask 'discord'
cask 'docker-desktop'
cask 'dropbox'
cask 'firefox'
cask 'font-hackgen'
cask 'font-jetbrains-mono'
cask 'gcloud-cli'
cask 'ghostty'
cask 'gimp'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'libreoffice'
cask 'licecap'
cask 'macvim-app'
cask 'macwinzipper'
cask 'ovice'
cask 'rubymine'
cask 'sequel-ace'
cask 'session-manager-plugin'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'vlc'
cask 'wezterm'
cask 'zoom'
