# Add Repository
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'aws/tap'
tap 'heroku/brew'
tap 'universal-ctags/universal-ctags'
tap 'ringohub/tfenv'

# Packages
cask 'temurin'

brew 'ag'
brew 'ansible'
brew 'ant'
brew 'antiword'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'awsebcli'
brew 'aws-sam-cli'
brew 'bazaar'
brew 'bzr'
brew 'chrome-cli'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'deno'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker-compose'
brew 'gawk'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'hg'
brew 'htop-osx'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq'
brew 'lua'
brew 'mercurial'
brew 'mpv'
brew 'msgpack'
brew 'newt'
brew 'nkf'
brew 'nodenv'
brew 'opencv'
brew 'openssl'
brew 'optipng'
brew 'pcre'
brew 'peco'
brew 'pipenv'
brew 'pkg-config'
brew 'pngquant'
brew 'potrace'
brew 'protobuf'
brew 'pstree'
brew 'pwgen'
brew 'python'
brew 'rbenv'
brew 're2c'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'rustup-init'
brew 's3cmd'
brew 'sqlite'
brew 'subversion'
brew 'texi2html'
brew 'tfenv'
brew 'the_platinum_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'universal-ctags', args: ['HEAD']
brew 'wget'
brew 'yarn', args: ['ignore-dependencies']
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'charles'
cask 'chromedriver'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-hackgen'
cask 'gimp'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-japanese-ime'
cask 'istat-menus'
cask 'iterm2'
cask 'libreoffice'
cask 'licecap'
cask 'macvim'
cask 'macwinzipper'
cask 'night-owl'
cask 'opera'
cask 'sequel-pro-nightly'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'vlc'
cask 'wavebox'
cask 'zoom'
