# Add Repository
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/binary'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/apache'
tap 'homebrew/php'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'peco/peco'
tap 'sanemat/font'
tap 'mpv-player/mpv'
tap 'splhack/splhack'
tap 'universal-ctags/universal-ctags'
tap 'alehouse/homebrew-unofficial'

# Packages
cask 'java7'
cask 'java'

brew 'ag'
brew 'ansible'
brew 'ant'
brew 'antiword'
brew 'apache-drill'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'awsebcli'
brew 'bats'
brew 'bazaar'
brew 'boost'
brew 'boot2docker'
brew 'byobu'
brew 'bzr'
brew 'cairo'
brew 'chrome-cli'
brew 'chromedriver'
brew 'clisp'
brew 'cloud-watch'
brew 'cmake'
brew 'cmigemo-mk', args: ['HEAD']
brew 'colordiff'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'docker-swarm'
brew 'ec2-api-tools'
brew 'erlang'
brew 'faac'
brew 'ffmpeg', args: ['HEAD']
brew 'fontconfig'
brew 'fontforge', args: ['env-std']
brew 'freetype'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go', args: ['cross-compile-common']
brew 'graphviz'
brew 'groonga'
brew 'harfbuzz'
brew 'haproxy'
brew 'heroku-toolbelt'
brew 'hg'
brew 'htop-osx'
brew 'httpd24'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'jenkins'
brew 'jmeter'
brew 'jpeg'
brew 'jpegoptim'
brew 'jq'
brew 'lame'
brew 'libevent'
brew 'libjpeg'
brew 'libjpeg-turbo'
brew 'libmemcached'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libxml2'
brew 'libyaml'
brew 'lua'
brew 'lynx'
brew 'mcrypt'
brew 'memcached'
brew 'mercurial'
brew 'mhash'
brew 'mongodb'
brew 'mpv', args: ['with-bundle', 'HEAD']
brew 'msgpack'
brew 'mysql', args: ['enable-local-infile']
brew 'newt'
brew 'nginx'
brew 'nkf'
brew 'oniguruma'
brew 'opencv'
brew 'openssl'
brew 'pcre'
brew 'peco'
brew 'phantomjs'
brew 'php-build', args: ['HEAD']
brew 'php-version'
brew 'phpenv', args: ['HEAD']
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'potrace'
brew 'pstree'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rbenv-vars'
brew 're2c'
brew 'readline'
#link 'readline --force
brew 'redis'
brew 'ricty'
brew 'rsense'
brew 'rtmpdump'
brew 'ruby-build'
brew 's-lang'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'screen'
brew 'sqlite'
brew 'subversion'
brew 'syck'
brew 'texi2html'
brew 'the_platinum_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'typesafe-activator'
brew 'unar'
brew 'universal-ctags', args: ['HEAD']
brew 'unixodbc'
brew 'valgrind', args: ['HEAD']
brew 'wget'
brew 'wxmac'
brew 'x264'
brew 'xmlto'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'z'
brew 'zlib'
brew 'zsh'

brew 'macvim-kaoriya', args: ['HEAD']

cask 'android-studio'
cask 'atom'
cask 'charles'
cask 'dash'
cask 'dropbox'
cask 'fabric'
cask 'firealpaca'
cask 'firefox'
cask 'genymotion'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'hyperswitch'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'iterm2'
cask 'libreoffice'
cask 'licecap'
cask 'limechat'
cask 'macwinzipper'
cask 'mplayerx'
cask 'night-owl'
cask 'nosleep'
cask 'opera'
cask 'quicksilver'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xtrafinder'
